In [23]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [24]:
df = pd.read_csv('UniversalBank.csv')

In [25]:
df.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1

In [26]:
train_df, test_df = train_test_split(df, test_size=0.4, random_state=42)

In [27]:
train_df.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
4576,4577,55,30,41,93003,2,0.6,3,0,0,0,0,1,1
1088,1089,59,35,95,95521,1,3.8,1,0,0,0,0,1,1
479,480,60,36,132,92154,2,6.0,1,470,0,0,0,1,1
727,728,62,37,18,92037,3,1.3,2,0,0,0,0,1,0
3783,3784,60,34,51,90028,3,1.4,3,0,0,0,0,0,0

In [28]:
melted = pd.melt(train_df, id_vars=['CreditCard','Personal Loan'], value_vars=['Online'])

In [29]:
melted.head()

   CreditCard  Personal Loan variable  value
0           1              0   Online      1
1           1              0   Online      1
2           1              0   Online      1
3           0              0   Online      1
4           0              0   Online      0

In [30]:
pivot_table = melted.pivot_table(index = ['CreditCard','Personal Loan'], aggfunc='count').drop('variable',1)

C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/3732007444.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  pivot_table = melted.pivot_table(index = ['CreditCard','Personal Loan'], aggfunc='count').drop('variable',1)

In [31]:
pivot_table.head()

                          value
CreditCard Personal Loan
0          0               1921
           1                199
1          0                800
           1                 80

In [34]:
cc_and_loan = pivot_table.xs([1,1])
sum_of_all_online = pivot_table['value'].sum()

prob_loan_accept = cc_and_loan / sum_of_all_online
print(f' prob of {round(prob_loan_accept.values[0], 3) * 100}%')

 prob of 2.7%

C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/2533660627.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  cc_and_loan = pivot_table.xs([1,1])

In [16]:
train_df.pivot_table(index = ['Personal Loan'], value_vars=['Online'])

TypeError: pivot_table() got an unexpected keyword argument 'value_vars'

In [17]:
train_df.pivot_table(index = ['Personal Loan'], values=['Online'], aggfunc='count')

               Online
Personal Loan
0                2721
1                 279

In [18]:
train_df.pivot_table(index = ['Personal Loan'], values=['CreditCard'], aggfunc='count')

               CreditCard
Personal Loan
0                    2721
1                     279

In [20]:
pivot_table = melted.pivot_table(index = ['CreditCard','Personal Loan',], aggfunc='count').drop('variable',1)

C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/3427323338.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  pivot_table = melted.pivot_table(index = ['CreditCard','Personal Loan',], aggfunc='count').drop('variable',1)

In [21]:
melted = pd.melt(train_df, id_vars=['CreditCard','Personal Loan'], value_vars=['Online'] aggfunc='count')

SyntaxError: invalid syntax (Temp/ipykernel_5684/1980388222.py, line 1)

In [62]:
CC = pivot_table.xs([0,1])
CC1 = pivot_table.xs([1,1])
CC1 / (CC + CC1)

C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/4016455306.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  CC = pivot_table.xs([0,1])
C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/4016455306.py:2: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  CC1 = pivot_table.xs([1,1])

value    0.286738
dtype: float64

In [43]:
train_df1 = train_df
train_df1 = train_df1[train_df1['Online'] == 1]
train_df1.pivot_table(index='Personal Loan', values=['Online'], aggfunc='count')

               Online
Personal Loan
0                1622
1                 175

In [49]:
train_df2 = train_df
train_df2 = train_df2[train_df2['Online'] == 0]
train_df2.pivot_table(index='Personal Loan', values=['Online'], aggfunc='count')

               Online
Personal Loan
0                1099
1                 104

In [56]:
ii = 175 / (175 + 104)
ii

0.6272401433691757

In [55]:
iii = 279 / (3000)
iii

0.093

In [57]:
iv = 800 / 3000
iv

0.26666666666666666

In [59]:
v = 1622 / (1099 + 1622)
v

0.5961043733921353

In [60]:
train_df2 = train_df
train_df2 = train_df2[train_df2['Personal Loan'] == 0]
train_df2.pivot_table(index='Online', values=['Personal Loan'], aggfunc='count')

        Personal Loan
Online
0                1099
1                1622

In [61]:
vi = 2721 / 3000
vi

0.907

In [64]:
(0.286738 * 0.62724 * .093) / ((0.286738 * 0.62724 * .093) + (.2666 * .5961 * .907))

0.1039764137898288

F) question D has a better estimate than pivot table B because it shows a 10% correlation compared to the pivot table that shows a 2.7% correlation. It also includes
all variables; CC, Personal Loan and Online Banking equaling 1 & 0 compared to the pivot table.

In [65]:
from sklearn.naive_bayes import GaussianNB

In [69]:
x_train, x_test, y_train, y_test = train_test_split(df.drop('Personal Loan', 1), df['Personal Loan'].values, test_size=0.4, random_state=42)

C:\Users\farcu\AppData\Local\Temp/ipykernel_5684/933157191.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  x_train, x_test, y_train, y_test = train_test_split(df.drop('Personal Loan', 1), df['Personal Loan'].values, test_size=0.4, random_state=42)

In [71]:
model = GaussianNB()
model.fit(x_train, y_train)

GaussianNB()

In [72]:
model.predict(x_test)

array([0, 1, 1, ..., 0, 0, 1], dtype=int64)

In [73]:
model

GaussianNB()

In [74]:
y_pred = model.predict(x_test)

In [75]:
from sklearn.metrics import confusion_matrix,accuracy_score
cm = confusion_matrix(y_test, y_pred)
ac = accuracy_score(y_test,y_pred)

In [76]:
cm

array([[1663,  136],
       [  80,  121]], dtype=int64)

In [77]:
ac

0.892